Track Name: Jingle Bells - Remastered 1999, Artist: Frank Sinatra, Album: A Jolly Christmas From Frank Sinatra, Popularity: 61, Lyrics: Jingle bells, jingle bells\nJingle all the way\nOh, what fun it is to ride\nIn a one-horse open sleigh\nJingle bells, jingle bells\nJingle all the way\nOh, what fun it is to ride\nIn a one-horse open sleigh\n\nDashing through the snow (Rudolph)\nIn a one-horse open sleigh (today)\nO'er the fields we go (Rudolph)\n...\n\nTrack Name: Santa Baby, Artist: Eartha Kitt, Album: The Essential Eartha Kitt, Popularity: 59, Lyrics: None \n Track Name: Mele Kalikimaka (Merry Christmas), Artist: Bing Crosby, Album: White Christmas, Popularity: 60, Lyrics: None\nTrack Name: Winter Wonderland, Artist: Darlene Love, Album: A Christmas Gift For You From Phil Spector, Popularity: 54, Lyrics: Sleigh bells ring, are you listenin'?\nIn the lane, snow is glistenin'\nA beautiful sight, we're happy tonight\nWalking in a winter wonderland\n\nGone away is the blue bird\nHere to stay is the new bird\nHe sings a love song, as we go along\nWalking in a winter wonderland\n\nIn the meadow we can build a snowman\nThen pretend that he is Parson Brown\n...\n\nTrack Name: Deck The Halls, Artist: Nat King Cole, Album: The Christmas Song (Expanded Edition), Popularity: 65, Lyrics: Deck the halls with boughs of holly\nFa-la-la-la-la, la-la-la-la\n'Tis the season to be jolly\nFa-la-la-la-la, la-la-la-la\n\nDon we now our gay apparel\nFa-la-la-la-la, la-la-la-la\nTroll the ancient Yuletide carol\nFa-la-la-la-la, la-la-la-la\n...\n\n

{"text": "Track Name: (Everybody's Waitin' For) The Man With The Bag, Artist: Kay Starr, Album: A Capitol Christmas, Popularity: 51, Lyrics: Old Mr.Kringle, is soon gonna jingle\nThe bells that'll tinkle all your troubles away\nEv'rybody's waitin' for the man with the bag\n'Cause Christmas is comin' again\nHe's got a sleighful, it's not gonna stay full\nHe's got stuff to drop at ev'ry stop of the way\nEv'rybody's waitin' for the man with the bag\n'Cause Christmas is comin' again\nHe'll be here with the answers to the prayers\nThat you've made through the year\nYou'll get yours if you've done ev'rything you should\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Frosty the Snowman, Artist: The Ronettes, Album: A Christmas Gift For You From Phil Spector, Popularity: 53, Lyrics: Frosty the snowman\nWas a happy jolly soul\nWith a corncob pipe and a button nose\nAnd two eyes made out of coal\n\nFrosty the snowman\nIs a fairy tale they say\nHe was made of snow, but the children know\nHow he came to life one day\n\nThere must have been some magic in\nThat old silk hat they found\nFor when they placed it on his head\nHe began to dance around\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Merry Christmas Darling - Remix, Artist: Carpenters, Album: Christmas Portrait (Special Edition/Reissue), Popularity: 56, Lyrics: Greeting cards have all been sent\nThe christmas rush is through\nBut i still have one wish to make\nA special one for you\n\nMerry christmas, darling\nWe're apart, that's true\nBut i can dream\nAnd in my dreams\nI'm christmasing with you\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: (There's No Place Like) Home for the Holidays - 1959 Version, Artist: Perry Como, Album: A Perry Como Christmas, Popularity: 53, Lyrics: Oh, there's no place like home for the holidays\n'Cause no matter how far away you roam\nWhen you pine for the sunshine of a friendly gaze\nFor the holidays, you can't beat home sweet home\n\nI met a man who lives in Tennessee, he was heading for\nPennsylvania and some homemade pumpkin pie\nFrom Pennsylvania folks are travellin'\nDown to Dixie's sunny shore\nFrom Atlantic to Pacific\nGee, the traffic is terrific\n\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Run Rudolph Run, Artist: Chuck Berry, Album: Rock 'N' Roll Rarities, Popularity: 63, Lyrics: None"}
{"text": "Track Name: The First Noël, Artist: Andy Williams, Album: The Andy Williams Christmas Album, Popularity: 54, Lyrics: Noël, noël, noël, noël\nBorn is the King of Israel\n\nThe first noël, the Angels did say\nWas to certain poor shepherds in fields as they lay\nIn fields where they lay keeping their sheep\nOn a cold winter night that was so deep\n\nNoël, noël, noël, noël\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: The Little Drummer Boy - Remastered 2006, Artist: Bing Crosby, Album: Bing Crosby - Christmas Classics, Popularity: 53, Lyrics: Come, they told me (parum-pa-pum-pum)\nA newborn king to see (parum-pa-pum-pum)\nOur finest gifts we bring (parum-pa-pum-pum)\nTo lay before the king (parum-pa-pum-pum, rum-pa-pum-pum, rum-pa-pum-pum)\nSo, to honor Him (parum-pa-pum-pum)\nWhen we come\n\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: White Christmas - 1947 Version, Artist: Bing Crosby, Album: Holiday Inn (Original Motion Picture Soundtrack), Popularity: 66, Lyrics: I'm dreaming of a white Christmas\nJust like the ones I used to know\nWhere the treetops glisten\nAnd children listen\nTo hear sleigh bells in the snow\n\nI'm dreaming of a white Christmas\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Joy To The World, Artist: Nat King Cole, Album: The Christmas Song (Expanded Edition), Popularity: 62, Lyrics: None"}
{"text": "Track Name: Here We Come a-Caroling / We Wish You a Merry Christmas, Artist: Perry Como, Album: A Perry Como Christmas, Popularity: 50, Lyrics: Here we come a-caroling\nAmong the leaves so green\nHere we coma a-wandering\nSo fair to be seen\n\nLove and joy come to you\nAnd to you glad Christmas too\nAnd God bless you and send you\nA Happy New Year\nAnd God send you a Happy New Year\n\nWe are not daily beggars\nThat go from door to door\nBut we are friendly neighbours\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: I Saw Mommy Kissing Santa Claus, Artist: The Jackson 5, Album: Christmas Album, Popularity: 60, Lyrics: Wow! Mommy's kissing Santa Claus!\n\nI saw Mommy kissing Santa Claus (kissing, kissing Santa Claus)\nUnderneath the mistletoe last night\nShe didn't see me creep\nDown the stairs to have a peep\nShe thought that I was tucked up\nIn my bedroom, fast asleep\n\nThen I saw Mommy tickle Santa Claus (tickle, tickle, Santa Claus)\nUnderneath his beard so snowy white\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: What Child Is This/The Holly And The Ivy - Medley / Remastered 2006, Artist: Bing Crosby, Album: Bing Crosby - Christmas Classics, Popularity: 51, Lyrics: What child is this, who laid to rest\nOn Mary's lap is sleeping?\nWhom angels greet with anthems sweet\nWhile shepherds watch are keeping\n\nThis, this is Christ the King\nWhom shepherds guard and angels sing\nHaste, haste, to bring Him laud\nThe babe, the Son of Mary\n\nSo bring Him incense, gold, and myrrh\nCome, peasant, king, to own Him\nThe King of Kings salvation brings\nLet loving hearts enthrone Him\n\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: The Nutcracker, Op. 71: Act II Tableau 3: Variation 2: Dance of the Sugar-Plum Fairy, Artist: Pyotr Ilyich Tchaikovsky, Album: Tchaikovsky: The Nutcracker, Popularity: 52, Lyrics: "}
{"text": "Track Name: Hark! The Herald Angels Sing/It Came Upon A Midnight Clear - Medley / Remastered 2006, Artist: Bing Crosby, Album: Bing Crosby - Christmas Classics, Popularity: 49, Lyrics: Gloria, Gloria\nIn excelsis Deo\n\nHark! The herald angels sing\n\"Glory to the newborn King!\nPeace on Earth and mercy mild\nGod and sinners reconciled\"\nJoyful, all ye nations rise\nJoin the triumph of the skies\nWith the angelic host proclaim\n\"Christ is born in Bethlehem\"\nHark! The herald angels sing\n\"Glory to the newborn King!\"\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Christmas Dream, Artist: Perry Como, Album: A Perry Como Christmas, Popularity: 45, Lyrics: Watch me now, here I go, all I need's a little snow\nStarts me off, sets the theme, helps me dream my Christmas dream\nEvery year I dream it, hoping things will change\nAn end to the crying, the shouting, the dying\n\nAnd I hope you will dream it too\nIt's Christmas, remember? We've got to remember\nSo, light the light, I'm home tonight\nI need you to warm me, to calm me, to love me\nTo help me, to dream my Christmas dream\n\nCrazy things, said and done, every single day but one\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: SkeeYee, Artist: Sexyy Red, Album: Hood Hottest Princess, Popularity: 81, Lyrics: (Tay Keith, fuck these niggas up)\nSkee-yee\n(DJ Meech, lil' bitch)\nSkee-yee\nSkee-yee\nSkee-yee\n\nIf you see me and you tryna see what's up (skee-yee)\nHe wanna fuck with me, then I'ma have him stuck (skee-yee)\nBitch lookin' bad, and got a stupid butt (skee-yee)\nJewelry on yo' wrist, fuck it, hold it up (skee-yee)\n\nWhen I holler, \"Skee-yee\" that mean pull up (skee-yee)\nCost 75, and they fast as fuck (skee-yee)\nI'm lookin' good when I'm hoppin' out that truck (skee-yee)\nWhere the hood niggas at that get them bucks? (Skee-yee)\n\nB-B-, Benz clean, but we ridin' dirty (yoon)\nSlidin' with your boo, yeah, that's my dirty (you know it)\nMy sister in the backseat with a .30 (baow)\nNiggas tryna shoot they shot, Stephen Curry (swish)\n\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Fighting My Demons, Artist: Ken Carson, Album: A Great Chaos, Popularity: 81, Lyrics: Where the fuck my blunt? Where the fuck my cup? Where the fuck my reefer?\n\nHuh, huh, huh, huh, huh, huh\nI'm smokin' on Kush\nHuh, huh, huh, huh, huh, huh\nI'm smokin' on Kush\nHuh, huh, huh, huh, huh, huh\nYou know I'ma chief 'em\nHuh, huh, huh, huh, huh, huh\nYou know I'ma chief—\n\nI'm flyin' just like a eagle\nBig gun, don't need it\n.45, long heater\nHellcat big, two-seater\nThis bitch said she was hungry, this dick what I feed her\nI'm on the block servin' entrees, yeah, three-fives a reefer\nYeah, yeah, you know I'ma chief 'em\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: First Day Out (Freestyle), Artist: Rundown Spaz, Album: First Day Out (Freestyle), Popularity: 63, Lyrics: Long live G\nFuck the peace, nigga\nOnly the E's (yeah, yeah)\nAyy, we ride when we sleep, for sure\nLet's go\nAin't no more, \"Free Spaz,\" nigga (go)\nAyy (go), the real Spaz, nigga (go)\nLong live G, long live G\nLet's go (go), let's go (go)\n\nBig ass Glock and it came with a switch (switch)\nNigga dissin' on Mac get left in a ditch (get left in a ditch)\n7.62 that'll go through the bricks\nBut, I'm bustin' the Glock when I go on a hit\nI'm smokin' on Ace, gettin' tired of this nigga\nTell his big brother, \"Come slide for this nigga\"\nBitch, I'm tryna sin, and this shit here on Christian\nYou fuck with the opps, you can die with them niggas\n\nSend my lil' ho, get the drop on them niggas\nJust like a picture, I'm croppin' a nigga\nI just came home from a two-year sentence\nI don't give a fuck, ain't no stoppin' me, nigga\nSlide on the North and drop me a nigga\nI'm droppin' yo' sister if that lil' ho with ya\nFree Draco, 'cause when he get out\nI'ma slide with a fully and drop the lil' nigga (brrt-brrt, baow)\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Family Freestyle, Artist: Lil Dann, Album: Family Freestyle, Popularity: 63, Lyrics: Young rich nigga, young rich nigga (Ayy, Luxury)\nHide ya bitch, nigga, hide ya-\nOoh, damn (What's up, Pyro?)\n\nI ain't never drove a C-Class, AMG, I'm too fast (ah)\nIf I don't get no lean today\nI fuck around and relapse (Yeah)\nShot his brother in his face\nI know that nigga three mad (okay)\nLike to mention, yesterday\nI put the BRABUS on the G-Wag' (yeah)\n\nShinin' like a light (Light), bitch, I'm litter (litter)\nWhen we come around, better\nTell them lil' niggas to put they bitch up (for sure)\nToday I fuck around and do some sit-ups (okay)\nNigga, nevermind, all these fuckin' chains on\nI can't even lift up (ah)\n\nI'm kickin' shit like Liu Kang (Kang)\nI'm superhero Dapper Dan, bitch, I'm Bruce Wayne (Wayne)\nBefore I ever save a ho, I'ma save the day (oh)\nI'm fuckin' with that Adderall, I been up all day (huh)\nLil' bitch, I'm gettin' paid, uh (yeah)\n\n(Uh) Lil Dann the richest young nigga in Atlanta (in Atlanta)\nLike BM, if we run the whole world, we need a banner (yeah)\n4PF got that city shit on lock\nAnd I put that shit on camera, nigga (let's go)\n\nI popped a pill and hit the bitch\nAnd I left her pussy swole (swole)\nShe try to run from me all night\nBut didn't know where to go (oh)\nThese diamonds on me, hittin' like ice\nFuck around and catch a cold (woah)\nReal G8 nigga, I was thirteen, trappin' at Texaco (yeah)\n\nYou think Lil Dann at war, you must be crazy, nigga (crazy)\nI'm my own boss, for real, and I got paid hitters (hitters)\nWe can go safe for safe, mine way bigger (yeah)\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Grip, Artist: Baby Tate, Album: Baby Tate Presents - Sexploration: The Musical, Popularity: 0, Lyrics: None"}
{"text": "Track Name: IT GIRL, Artist: Aliyah's Interlude, Album: IT GIRL, Popularity: 83, Lyrics: Aliyah's Interlude in this bitch\nYou already know\nAliyahCore today, tomorrow, yesterday, and forever, period\nThe fuck?\n\nBitch, you know I'm sexy\nUh, don't call, just text me\nBitches slow, can't get on my speed\nThey stare 'cause they know I'm the\n\nI-T G-I-R-L\nYou know I am that girl\nShh, bitch, don't kiss and tell\nIt girl from ATL\nI, I-T G-I-R-L\nYou know I am that girl\nShh, bitch, don't kiss and tell (ah)\nIt girl from ATL\n\nHow you mad at me 'cause I'm cunt? Bitch\nHow you mad at me 'cause I run shit?\nBe mad at yourself, 'cause you ain't done shit\nTalkin' all that shit is redundant\n\nTrendsetter, bitch, don't be actin' surprised\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Mmhmm, Artist: BigXthaPlug, Album: Mmhmm, Popularity: 72, Lyrics: (Ayo, Bandplay)\n\nAyy\n(Let the Bandplay)\n\nI just went, bought a watch with a whole lot of diamonds\nTo show all these niggas it's my time\nTook a trip out to Cali' to hang with the Crips, make a play, and get high off that zaza\nI say RIP Kobe, a nigga so fly, when I ball, I'll fuck around, skydive\nSo much chicken on me, could've went bought a Williams, a Rudy's, a big-ass Popeye's\nAnd a whole different bracket, this life is emetic\nIf you hit me for 'bows, then you know that I'm taxin'\n\nKeep buying clothes, that shit still in the packages\nIf he say that he robbed me, he cappin' then\nReally know niggas throw sevens like Kaepеrnick\nYou not blind, then you see that we havin' it\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Not a Drill, Artist: Veeze, Album: Ganger, Popularity: 62, Lyrics: This is not a fire drill, nigga\nThis is not a fire drill, nigga this the real thing (aw man, gerski)\nGang, gang, yeah (you knowthat)\n\nFuck that bitch at nighttime, daytime she won't see me\nActin' like a asshole, pocket holdin' fifty (you know that)\nPull up with a Mickey Mouse clip, this ain't Disney (this ain't Disney)\nSpin a bend and faceshot a nigga, steal identity (face his ass)\nPut a brick of dog food on you, can you flip it? (Can you?)\nSippin' lean like Paul Wall, I might just put a grill in (yeah)\n\nBoy, go get your pompoms, chillin' with the bitches (chillin' with the bitches)\nYou know me, pull a Pluto move, take wife, Scottie Pippen (hahaha)\nThis cup full of all red like it beef with Crippin' (like it beef with Crippin')\nI damn near got head from every bad bitch in the city (keep that)\nDoggy in a 360 deal pullin' gimmicks (I swear to God)\n\"What's that floatin' in your cup?\" Mind your business (shh)\n\nI'm on SportsCenter, Rodeo, pulled Achilles\nI spent a band on drank before I ate, I need an ass whippin'\nMy closet like a fuckin' clothing store, I need a cash register\nDamn, I feel abused, bitches pullin' on my belt buckle (these bitches pullin' on me)\nNigga you need help with some'? Nigga pump the gas or some'\nOrder 10K ones on that bum, put confetti on 'em\n\nCatch a nigga slip, switch hrrrt, spaghetti on 'em\nI gotta keep my double cup so I won't go to hell alone (hell alone)\nThis is not no fire drill, nigga, I got fire on me (I got fire on me)\nLex just walked in, that's my twin, Balenciaga on me (that's my twin, Balenciaga on me)\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Jennifer’s Body, Artist: Ken Carson, Album: A Great Chaos, Popularity: 80, Lyrics: Fuck\n\nTwo things I ain't ever seen\nA nigga that beat a gun and a bitch I need\nIf I go broke, I'm takin' your funds, yeah, bitch, I need it\nGave you the whole book on how to get rich and you ain't even read it\nJennifer's Body, my bitch is a hottie, my bitch is a boy eater\nShe don't even want no food, this dick the only thing I feed her\nThis bitch a thot, ain't no way, huh, I'ma keep her\nI made a hundred K in a hundred ways, 'cause that's what I keep\nKeep it a hunnid\nI got diamond, I got money\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Come Outside (feat. YTB Fatt), Artist: Icewear Vezzo, Album: Come Outside (feat. YTB Fatt), Popularity: 49, Lyrics: None"}
{"text": "Track Name: Gun Class II (feat. Nardo Wick & G Herbo), Artist: MudBaby Ru, Album: Gun Class II (feat. Nardo Wick & G Herbo), Popularity: 54, Lyrics: None"}
{"text": "Track Name: Just Like Me, Artist: Heembeezy, Album: Just Like Me, Popularity: 64, Lyrics: None"}
{"text": "Track Name: With My Boo, Artist: SleazyWorld Go, Album: With My Boo, Popularity: 52, Lyrics: None"}
{"text": "Track Name: Paranoid (feat. Destroy Lonely), Artist: Ken Carson, Album: A Great Chaos, Popularity: 79, Lyrics: Wake up, F1LTHY\n\nHuh, huh-huh, huh-huh\n\nAnd that Kel-Tec gon' make a nigga flip like gymnastics\nI fuck Barbie bitches, yeah, yeah, all my hoes plastic\nAll my hoes know how to act, all my hoes classy\nAll my hoes fuck me like they life on the line\nShe fuckin' with the gang, yeah, she know every gang sign\nIf I call her, she gon' pull up, yeah, every time\nI got one in the head, yeah, of my .9\nI'm paranoid, I'll take your life, yeah, before you take mine\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: CLASSY (feat. Tony Shhnow), Artist: Joony, Album: MEMENTO, Popularity: 40, Lyrics: None"}
{"text": "Track Name: Clocking U, Artist: Cash Cobain, Album: Pretty Girls Love Slizzy, Popularity: 50, Lyrics: 1 o'clock, 2 o'clock, you ain't pulling up\nLiquor shots, hookah shots, you ain't get enough\nSpin a block, spin the block lookin for your love\nSpin a block, spin a block lookin for your love\nWoah, Woah\nHundred thots, two hundred thots ain't enough\nHunnit opps lookin at you, know they wanna fuck\nI ain't even blame them you too much\nWoah, woah\n1 o'clock, 2 o'clock, still ain't pulling up\nLiquor shots, hookah shots, still ain't get enough\nSpin a block, spin a block lookin for your love\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Wicked Romance, Artist: Scorey, Album: Wicked Romance, Popularity: 22, Lyrics: None"}
{"text": "Track Name: On A Star (feat. FendiDa Rappa & Raiche), Artist: Lil Eazzyy, Album: On A Star (feat. FendiDa Rappa & Raiche), Popularity: 40, Lyrics: None"}
{"text": "Track Name: BING BONG (Remix) [feat. Sexyy Red], Artist: BlakeIANA, Album: BING BONG (Remix) [feat. Sexyy Red], Popularity: 57, Lyrics: None"}
{"text": "Track Name: Rich Talking (feat. BabyTron), Artist: Babyfxce E, Album: Rich Talking (feat. Babytron), Popularity: 40, Lyrics: None"}
{"text": "Track Name: In Your Hands (feat. Ty Dolla $ign), Artist: Maiya The Don, Album: Hot Commodity, Popularity: 51, Lyrics: None"}
{"text": "Track Name: catch a kill, Artist: Destroy Lonely, Album: If Looks Could Kill (Directors Cut), Popularity: 65, Lyrics: Huh, huh, shawty, she dancin', making a scene\nAss bounce, trampoline, I got a whole lot of pints of lean\nI got a whole lot of clothes, Celine\nI got a whole lot of sticks and ammo, bitch, I loaded the magazine\n\nI look like to model, I look like I'm 'posed to just pose on the cover of magazines\nMy bitch like a model, she look too bad, but nah, she ain't too bad for me\nMe and the gang, we slide, we creep\nI'm in a Trackhawk Jeep, my boy in the 720S, McLaren\nSuicide doors on the creature, my main ho trippin', yeah\n'Cause I don't be caring, I'm too damn evil\nI can't even lie, you pretty, baby, but I don't think that I need you\n\nHuh, I'm sippin' on red, yeah, my young nigga will wet you up\nI got rich, upper echelon, my bad bitch too wet, yeah\nI got water, I got way more water than a bathtub\nI just been tweakin' lately, huh, I don't give no fuck\nTell that ho to pull up, I'ma throw it, throw more than a dub\nStripper party in the studio, I don't go to clubs\nI'm at Prime Italian, in Miami, bitch, I'm eatin' good\nI know my niggas tied, so I gotta get up out that hood\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: You (feat. Bryson Tiller), Artist: Lola Brooke, Album: You (feat. Bryson Tiller), Popularity: 70, Lyrics: Tonight, tonight, tonight, oh\nYeah, Tiller, whoa\nAnd Young Lola, controller, come closer\nMad pretty, make me lose composure\nTad tipsy, won't you come over?\nLast lap in the city, know I'm unsober\nTrue, know I see you come over (you know I see you over there, there, there?)\nUh-uh, uh-uh\n\nI'm a badass Brooklyn brown skin bitch (brown skin bitch)\nAnd I love a hood nigga with some toxic dick (hey, baby)\nNothing but some socks, beef and brocs in it (whoa)\nHave me walking all crooked in my Crocs and shit (Brr)\nBitch, I go Taraji for my baby boy (for my baby boy)\nRide it like a Kawasaki, that's his favorite toy (favorite toy)\n\nI'ma swipe his EBT like a Amex (uh)\nGive it to him raw (uh), no drawers, no latex (uh, uh)\nYeah, I got him butt-naked for me waitin' at home (waitin' at home)\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Sideways (with NLE Choppa), Artist: Fredo Bang, Album: Sideways, Popularity: 61, Lyrics: Ain't that DJ Chose over there?\nMm, look like DJ Chose\n\nSome days, wanna be yo' bae\nSome days, wanna cut you off\nSome days, wanna block yo' number\nSome days, wanna slut you out\nYou say you hate bein' sober\nYou say I'm so bipolar\nI say, \"I'm done with yo' lil' crazy ass,\" and still come over\n\nCash be too high, I pull up early noon, high\nWhen I be done with two light\nI'm all on yo' side\nSo when I get that, you ride\nAnd when I get that, you ride\n\nCan you ride it sideways? (Can you ride it sideways?)\nShow what you gon' do to me (try it for me)\nBy your side\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Bae, Artist: Skilla Baby, Album: Bae, Popularity: 48, Lyrics: None"}
{"text": "Track Name: Privacy, Artist: Lil Goat, Album: Privacy, Popularity: 64, Lyrics: Nigga know what are we\nNigga don't know any trick\nNigga just seated on-\nShe tryna chill, not hanging with me\nAsk them film on almost snitch\nYeah, yeah, yeah, yeah\n\nShe tryna pop her a Molly, I told that girl come and get high with me, uh\nShe jumped in ride with me, she suck it while I'm in the driver's seat, uh\nShe tryna go through my phone, I told that bitch I need my privacy, uh\nWhen I pop out, no, I'm never alone, I gotta keep my guys with me\nMe and my team, we forever elite, she tried to cheat like I ain't even peep\nWhy would I lie when I got the receipts? I keep my fye 'cause this shit can get deep\nI got some hoes, they switch every week, I'm with my bros, we lit and we geeked\nDiamonds on froze, this shit ain't come cheap, I know you told, ain't about what you preach\n\nThis rich nigga dick, it ain't free\nShe tryna fuck, told her \"Pay me a fee\"\nI bought a new Coupe, and it don't need no keys\nI'm spending on fashion, I've been on a spree\nI went to the lot and I bought about three\nYou said that you gangsta, but I don't agree (yeah, yeah)\nIf you seen a jury, you will take a plea\nHave you seen my jewelry? My diamonds on freeze\n\nI know I'm ahead of my time, and it's perfectly fine as long as I grind every week\nNo, it's not easy to do this all on your own, but luckily, I was unique\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Can’t Go To Jail (feat. Sett, YTB Fatt), Artist: Finesse2tymes, Album: Can’t Go To Jail (feat. Sett, YTB Fatt), Popularity: 47, Lyrics: None"}
{"text": "Track Name: Jenn Jenn Jenn, Artist: 41, Album: Jenn Jenn Jenn, Popularity: 59, Lyrics: None"}
{"text": "Track Name: Black Truck, Artist: Real Boston Richey, Album: Black Truck, Popularity: 48, Lyrics: None"}
{"text": "Track Name: Deli, Artist: Ice Spice, Album: Like..? (Deluxe), Popularity: 85, Lyrics: Grrah, grrah, grrah, grrah\nGrrah, grrah, grrah, grrah\nShe a baddie, she showin' her panty (she showin' her panty, she showin' her panty)\nStop playin' with 'em, RIOT\n\nShe a baddie, she showin' her panty (she showin' her panty)\nShe shake it like jelly (she shake it like jelly, damn, damn)\nHunnit bands in Chanely (hunnit bands in Chanely)\nBut I'm still shakin' ass in the deli (but I'm still shakin' ass, grrah, grrah)\nWith my bitch gettin' dirty (with my bitch gettin' dirty)\nHe like him a wetty (he like him a wetty)\nHe want the WAP, but I just want the fetty (grrah, grrah)\nAnd I'm baggin' his partner, I'm petty (grrah, grrah)\n\nCall me that bee while he eatin' my honey (eatin' my honey, damn)\nYou know niggas like bitches with money (bitches with money)\nI get a lot (I get a lot)\nTakin' her spot (grrah, grrah, grrah)\n\nIf you ain't cookin' then get off the pot\nMy name Ice but I always stay hot\nPassenger princess, he pass me his knock (grrah, grrah)\nBaddest lil' bitch from my block\n\nMe and baddies be gettin' along\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: FOLD, Artist: SwaVay, Album: FOLD, Popularity: 38, Lyrics: None"}
{"text": "Track Name: Gang Time, Artist: Calboy, Album: Gang Time, Popularity: 50, Lyrics: None"}
{"text": "Track Name: World on Fire, Artist: Nate Smith, Album: NATE SMITH (DELUXE), Popularity: 78, Lyrics: Girl, when you called it quits\nYou could have done it right\nYou could have left this town out of it when you said goodbye\n\nYou ruined everything I love\nRipped my heart right out my chest\nGirl, it's like there ain't nothing left\n\nYou set my world on fire, yeah, it's all long gone\nI'm watching flames get higher, and I can't move on\nI just gotta let it burn, burn, burn on down\nGirl, without you, it don't turn, turn, turn around\nYou set my world on fire\nYou set my world on fire\n\nCan't hit that corner bar\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: White Horse, Artist: Chris Stapleton, Album: White Horse, Popularity: 82, Lyrics: This love, is getting kind of dangerous\nFeels like it's a loaded gun\nMy-my, it's turning like a cloud of dust\nMy heart always wants to run\n\nOh-oh-oh-oh\nIf you want a cowboy on a white horse\nRiding off into the sunset\nIf that's the kind of love you wanna wait for\nHold on tight, girl, I ain't there yet\nNo, I ain't there yet\nNo, I ain't there yet\n\nWhite horse\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: This Town's Been Too Good To Us, Artist: Dylan Scott, Album: This Town's Been Too Good To Us, Popularity: 78, Lyrics: Gave us that hilltop place to park\nGave us them girls that stole our hearts\nGave us them bucks up on the wall\nThe way we live and the way we talk\n\nGave us state that senior year\nThem country stores to buy that beer\nA place to go nobody knows\nWhen you take it in and you take it\n\nSlow like that river rolls\nWhere that green grass grows\nI can't explain it\nAw, it's something, ain't it?\n\nYeah, we sure painted it up, tore down them old two-lane roads\nWe either stole every sign or left 'em in bullet holes\nIt wasn't nowhere as bad as we all said that it was\nYeah, looking back at it now, this town's been too good to us\n\nRaised hell on the weekends, yeah\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Burn It Down - Radio Edit, Artist: Parker McCollum, Album: Burn It Down (Radio Edit), Popularity: 71, Lyrics: None"}
{"text": "Track Name: Pretty Little Poison, Artist: Warren Zeiders, Album: Pretty Little Poison, Popularity: 77, Lyrics: Every night around about this time\nIt's like she knows I'm lonely\nRolls up when the wine is gone like a record on repeat\nLeanin' on old memories\nAnd talkin' 'bout what used to be\nShe'll probably be the death of me\nBut, damn, if it ain't sweet\n\nShe's my pretty little poison\nMy heartache in the night\nWith a kiss on her lips just like cyanide\nYeah, she came with a warning\nBut I didn't mind\nI'll go out on that high every time\nShe's my pretty little poison\nMy pretty little poison\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: The Painter, Artist: Cody Johnson, Album: The Painter, Popularity: 79, Lyrics: She talks about the future like she's flippin' through a magazine\nFinds the beauty in the thrown away and broken things\nGets excited about all my crazy dreams\n\nGot every sunset that she's ever seen memorized\nSaves them away for a rainy day or stormy night\nThe sky is brighter lookin' at it through her eyes\n\nI don't remember\nLife before she came into the picture\nBrought the beauty I was missin' with her\nShowed me colors I ain't never seen\n\nShe took chances\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Something's Gonna Kill Me, Artist: Corey Kent, Album: Something's Gonna Kill Me, Popularity: 73, Lyrics: I've watched a California sunset\nBurn from orange to gold\nBought a pawn shop six string\nSold my soul to rock and roll\nThey say if you ain't busy livin'\nThen you're just dyin' slow\nI wanna say I've done it all\nBy the time it's time to go\n\nWhere and when and what'll be the death of me\nWell, heaven only knows\n\nIt might be the highway\nAnd it might be these songs\nIt might be the whiskey or the smoke inside these lungs\nAin't no way around it\nOne day I'm gonna die\nIf something's gonna kill me, might as well be\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Porch Light, Artist: Josh Meloy, Album: Porch Light, Popularity: 80, Lyrics: Drivin' through the night, tryna keep my eyes open\nGenerator's busted and the A/C's broken\nTalkin' to the Lord, hope He helps us get there safe\nAnd we made it to the show, now we're singin' to the crowd\nAnd play an encore and they're screamin' real loud\nTry to get home early, but I know that ain't the case\n\nYeah, it's another hotel room, sleepin' on the floor\nI'm hurtin' in the mornin' from the night before\nPaid my dues, I'm leadin' up the road\nI'm comin' home, baby, leave the porch light on\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Mamaw's House, Artist: Thomas Rhett, Album: Mamaw's House, Popularity: 77, Lyrics: (Sorry, y'all, my mamaw's callin' me; I'll ca- I'll be right back)\n(Hello?)\n(Whatcha doin' Morgan?)\n(Hey, I'm just, I'm writing on a...)\n\nIt was always hotter than the grease\nShe used to fry that chicken\nSmelled like Malboro Reds\nAnd all the butter from her biscuits\nAnd that Lincoln in the driveway circa 1982\nWas on the shiny side of rusty\nAnd on the paler side of blue\nAnd cussin' and complaining' weren't allowed\nAt Mamaw's house\n\nIf every night stand had a bible\nEvery front porch had a swing\nIf every back yard had a garden\nEvery front door had a screen\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Different 'Round Here, Artist: Riley Green, Album: Different 'Round Here, Popularity: 76, Lyrics: 'Round here fast is how the grass grows\nLost is what you find on a back road\nProof's in the whiskey, red's in the dirt\nAnd hard work stops at the fence row\nWe stand for the flag and if you don't like it we don't care\n'Cause we do things a little different 'round here\n\nBrave is 18 wearin' army green\nTruth is in the words, in red we read\nProud is what you say about where you're from\nHeroes are daddies and mamas are love\nThe right is right and wrong is wrong\nYeah, we're doin' things a little different 'round here\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: But I Got A Beer In My Hand, Artist: Luke Bryan, Album: But I Got A Beer In My Hand, Popularity: 74, Lyrics: (Yeah)\n(Yeah)\n\nThat old familiar, meant to kill you, middle finger, rearview mirror\nSupposed to make a country boy sad\nI should be in my recliner, whiskey typin' up one-liners\nCryin', trying to get you back\n\nYeah, I know how that country song goes\nI'm supposed to be heart-broke\n\nBut I got a beer in my hand, and I got it raised up high (high)\nI ain't got a give in my damn right, I can do this all night\nCountry done came to town, this town don't stand a chance (chance)\nI'll holler at the ladies, dancin' like crazy\nNew Luccheses, fresh up out the deer stand\nFeelin' this high (high), wasn't part of my plan\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Back Then Right Now, Artist: Tyler Hubbard, Album: Back Then Right Now, Popularity: 68, Lyrics: Back then, right now\n\nBack when that blacktop was just a gravel road\nBack when that Walmart was just a fishin' hole\nBack when my ol' guitar had some brand-new strings\nYes, it did\n\nBack when a work truck was just a stick shift\nBack when you took a pic and didn't have to post it\nBack when the Baptist church was where we learned to sing\nYeah, we did\n\nI could use some back then, right now\n'98 Chevy with the tailgate down\nFM only with the gold up loud\nBurnin' up the night\nInnocent and wild\n\nI could use a little more wide-open\nBack when all I wanted was the hand I was holdin'\nLivin' in the moment with the good-time crowd\nMakin' life count\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Straight and Narrow, Artist: Sam Barber, Album: Million Eyes, Popularity: 73, Lyrics: When there's a storm raging in your soul\nYou gotta thank God that you're still growing old\nIf them demons you're fighting won't go away\nDrop on your knees and pray\n\nLife can get hard sometimes, I know\nYou got to get up and walk the straight and narrow\nWhen they're chasing you down with an old bloodhound\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Heartbroken - Jessie Version, Artist: Diplo, Album: Diplo Presents Thomas Wesley: Chapter 2 - Swamp Savant, Popularity: 73, Lyrics: Used to pray for rain just to stay inside\nYou wouldn't believe it, every move I made, I was terrified\nThought that every road I took had a bitter end\nI just couldn't see it, I convinced myself trynna trust again\nWould be like tryna make a river run upstream\nTrynna make a mountain into a valley\nThat's what your love does to me\nYou make me feel\nLike I never had my heart broken\nLike I never saw a door closin'\nLike I never watched love run away on fire\nIn the night like a pack of wild horses\nLike I never felt the tears rolling\nLike I never said: \"Here's hopin'\"\nI could find me someone who's good at being real\nWho could make me feel wide open\nLike I never had my heart\nBroken (broke-broken)\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Hold On, Artist: Luke Grimes, Album: Hold On, Popularity: 71, Lyrics: Hold me\nBut I don't recommend that you adore me\nIf you do, don't say I didn't warn you\nTrust me, I know how to start a fire from a flame\n\nOh, I always\nLeave before the curtain hits the floorboard\nWhen I hear you talking like you know me\nYou don't know me, You don't know me\n\nWish that I could not go crazy\nWish that I could make you hate me\nMaybe I should change my name and run\nSo I don't have to hold on\n\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Ain't Missin' You, Artist: Dylan Schneider, Album: Ain't Missin' You, Popularity: 72, Lyrics: I hope it hurts, I hope you're mad\nI hope you're thinkin' how that girl was the best you ever had\nI hope you're drunk and it don't help\nI hope you spend the last few months feelin' sorry for yourself\n\nGuys like you don't get second chances, no\nAnd girls like her ain't meant for lovin' and lettin' go\n\nI hate to break it to you\nBut she's movin' on like you thought she'd never would\nAnd if I'm bein' honest with you\nWhen she's in my arms, she says it feels like it should\nShe's been pickin' up the pieces, puttin' you on a shelf\nAin't thinkin' 'bout your goodbye, 'cause somebody else is\nKissin' her, holdin' her, lovin' her like you couldn't do\nSo, if you're missin' her, man, she ain't missin' you\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Save Me The Trouble, Artist: Dan + Shay, Album: Save Me The Trouble, Heartbreak On The Map, Bigger Houses, Popularity: 71, Lyrics: I can tell by the way that you're stirring your drink\nOh, we're already playing with fire\nSaid that you had to go about an hour ago\nBaby, you're such a beautiful liar\n\nIt feels like a movie I've already seen\nSo right now I'm begging you, please\n\nWhy don't you save me the trouble?\nKeep those pretty blue eyes to yourself\nWhy don't you save me the trouble?\nGive that heartache to somebody else\n\nIf you're the kinda girl that's only gonna wanna love and leave\nA guy like me alone in this bar drinking double\nWhy don't you save me the trouble?\nSave me the trouble, baby\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Paint The Town Red, Artist: Doja Cat, Album: Scarlet, Popularity: 89, Lyrics: By\nWalk on by\nWalk on by\nWalk on by (yeah)\nWalk on by\n\nYeah, trick, I said what I said\nI'd rather be famous instead (walk on by)\nI let all that get to my head\nI don't care, I paint the town red (walk on by)\n\nTrick, I said what I said\nI'd rather be famous instead (walk on by)\nI let all that get to my head\nI don't care, I paint the town red (walk on by)\n\nMm, she the devil\nShe a bad lil' b-, she a rebel (walk on by)\nShe put her foot to the pedal\nIt'll take a whole lot for me to settle (walk on by)\n\nMm, she the devil\nShe a bad lil' b-, she a rebel (walk on by)\nShe put her foot to the pedal\nIt'll take a whole lot (yeah) for me to settle (walk on by)\n\nYeah, said, my happiness is all of your misery\nI put good all in my kidneys (walk on by)\nThis Margiel' don't come with no jealousy\nMy illness don't come with no remedy (walk on by)\n\nI am so much fun without Hennessy\nThey just want my love and my energy (walk on by)\nYou can't talk no without penalties\n- I'm in yo' - if you send for me (walk on by)\n\nI'm goin' to glow up one more time\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Strangers, Artist: Kenya Grace, Album: Strangers, Popularity: 98, Lyrics: Uh-huh, uh-huh, uh\nUh-huh, uh-huh, uh\nUh-huh, uh-huh, uh\nUh-huh, uh-huh\n\nAlways ends the same\nWhen it was me and you\nBut every time I meet somebody new\nIt's like déjà vu (déjà vu)\nI swear they sound the same\nIt's like they know my skin\nEvery word they say sounds just like him\nAnd it goes like this\n\nWe'll get in your car and you'll lean to kiss me\nWe'll talk for hours and lie on the backseat\nUh-huh, uh-huh, uh\nUh-huh, uh-huh\nAnd then one random night when everything changes\nYou won't reply and we'll go back to strangers\nUh-huh, uh-huh, uh\nUh-huh, uh-huh, uh\n\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: My Love Mine All Mine, Artist: Mitski, Album: The Land Is Inhospitable and So Are We, Popularity: 96, Lyrics: Moon, a hole of light\nThrough the big top tent up high\nHere before and after me\nShinin' down on me\nMoon, tell me if I could\nSend up my heart to you?\nSo, when I die, which I must do\nCould it shine down here with you?\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: 3D (feat. Jack Harlow), Artist: Jung Kook, Album: 3D : The Remixes, Popularity: 89, Lyrics: None"}
{"text": "Track Name: IDGAF (feat. Yeat), Artist: Drake, Album: For All The Dogs, Popularity: 94, Lyrics: Traveling forever in the dark\nDarkness into blackness\nThere and back, it's always black\n\nOh-ah, it screeched across the sky\nNothing to do, but lie\n\nFuck the bitch, I make her sweat, huh, I'ma die by my respect, huh\nI put a check up on my neck, life check ya in the head\nI signed for a couple milli', you only touched a hundred thou'\n\n(I-I-I—) Man, I don't give a fuck who it is\nI know I got my twizz'\nNot in a long time, yeah, don't give a fuck what y'all on (I-I-I—)\nMan, fuck all of you (All of you)\n\nYeah, I don't be givin' no fucks (Not one), uh (Just pull up, pull up, woah)\nI don't know if you caught on (Caught on) I don't be givin' no fuck (Huh)\nI say whatever I want, yeah, I do whatever I want, huh\nI'm countin' up money for fun, and I'm poppin' these Percs just for fun (Luh geek)\n\nLook, comin' live from the\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: I Wanna Be Yours, Artist: Arctic Monkeys, Album: AM, Popularity: 95, Lyrics: I wanna be your vacuum cleaner\nBreathing in your dust\nI wanna be your Ford Cortina\nI will never rust\n\nIf you like your coffee hot\nLet me be your coffee pot\nYou call the shots, babe\nI just wanna be yours\n\nSecrets I have held in my heart\nAre harder to hide than I thought\nMaybe I just wanna be yours\nI wanna be yours, I wanna be yours\n\nWanna be yours\nWanna be yours\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: LADY GAGA, Artist: Peso Pluma, Album: GÉNESIS, Popularity: 95, Lyrics: Dom Perignon Lady Gaga, lentes en la cara\nTusi lavada\nTriple lavada y una bandida que me llama\nQuieren mi lana\nY no está mal\nPorque me seduce como animal\nNinguna sube nada al Instagram\nSolo disfrutan, solo disfrutan\n\nPura influencer bien placosa, las que navegamos\nY las volamos\nY unas' privadas en yate, tronamos las pacas\nY sin Yolanda\nMe vo'a enfiestar\nPolvito rosa, plumita de wax\nEsa estructura vale 30k\nNo puedes pagar, no te va a alcanzar\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: What Was I Made For? [From The Motion Picture \"Barbie\"], Artist: Billie Eilish, Album: What Was I Made For? [From The Motion Picture \"Barbie\"], Popularity: 96, Lyrics: Hm, hm\n\nI used to float, now I just fall down\nI used to know, but I'm not sure now\nWhat I was made for\n\nWhat was I made for?\n\nTaking a drive, I was an ideal\nLooked so alive, turns out I'm not real\nJust something you paid for\n\nWhat was I made for? Hm\n\n'Cause I, I\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Blank Space, Artist: Taylor Swift, Album: 1989, Popularity: 83, Lyrics: Nice to meet you, where you been?\nI could show you incredible things\nMagic, madness, heaven, sin\nSaw you there and I thought\nOh my God, look at that face\nYou look like my next mistake\nLove's a game, wanna play?\n\nNew money, suit and tie\nI can read you like a magazine\nAin't it funny, rumors fly\nAnd I know you heard about me\nSo hey, let's be friends\nI'm dying to see how this one ends\nGrab your passport and my hand\nI can make the bad guys good for a weekend\n\nSo it's gonna be forever\nOr it's gonna go down in flames\nYou can tell me when it's over\nIf the high was worth the pain\nGot a long list of ex-lovers\nThey'll tell you I'm insane\n'Cause you know I love the players\nAnd you love the game\n\n'Cause we're young and we're reckless\nWe'll take this way too far\nIt'll leave you breathless\nOr with a nasty scar\nGot a long list of ex-lovers\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Prada, Artist: cassö, Album: Prada, Popularity: 94, Lyrics: 'Bout to take my lady Selfridges\nNew drip on the way, uh-huh\nRap nigga still sellin' bricks\nHalf a cake on the way, uh-huh\nTake a flight, she wanna take a Lyft\nFor the molly man, he's on the way, uh-huh\nI might take her The Shard, I might take her The Ritz\nIt don't matter, baby, I'm straight, uh-huh\n\nI feel like I'm in Prince's house\nPurple paint all on the walls, uh-huh\nSittin' down on this fancy couch\nAnd I can't see straight, I'm a state, uh-huh\n22, I'm in Paris, baby\nGot a strippers tits in my face, uh-huh\nPull up in a Bentley\nI want Christian, I want Fendi\n\nI want Prada\nOoh, ooh, ooh\nI already make that paper\nI don't need to chase no clout, wow\nI don't usually pipe up\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: One Of Your Girls, Artist: Troye Sivan, Album: Something To Give Each Other, Popularity: 86, Lyrics: Everybody loves you, baby\nYou should trademark your face\nLinin' down the block to be around you\nBut, baby, I'm first in place\n\nFace card, no cash, no credit\nYes, God, don't speak, you said it\nLook at you\nSkip the application, interview\nSweet like Marabou\nLook, look at you\n\nGive me a call if you ever get lonely\nI'll be like one of your girls or your homies\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Columbia, Artist: Quevedo, Album: Columbia, Popularity: 95, Lyrics: Volvió de estudiar en Columbia a la isla sin nada que hacer\nEl año se le hizo largo, estudio' y cumplir su deber\nEn llamada, su amiga le dice que este verano es pa beber\nSolo quiere salir y de nadie depender\n\nHasta que me conoció, ella no se lo esperaba\nLa vi entrando en la disco, me devolvió la mirada\nSonrisita nerviosa, entre besos se enfadaba\nSe le escapó un \"te quiero\" a la que no quería nada\nHasta que me conoció, ella no se lo esperaba\nLa vi entrando en la disco, me devolvió la mirada\nSonrisita nerviosa, entre besos se enfadaba\nSe le escapó un \"te quiero\" a la que no quería nada\n\nBebé, los dos sabemo' que e' verano y que tal vez\nCuando termine agosto, no nos volvemo' a ver\nPero quiero tener algo pa cuando no estés\nAsí que acumulemo' recuerdo', cada vez que el labio te muerdo\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: I Remember Everything (feat. Kacey Musgraves), Artist: Zach Bryan, Album: Zach Bryan, Popularity: 94, Lyrics: Rotgut whiskey's gonna ease my mind\nBeach towel rests on the dryin' line\nDo I remind you of your daddy in his '88 Ford?\nLabrador hangin' out the passenger door\nThe sand from your hair is blowin' in my eyes\nBlame it on the beach, grown men don't cry\nDo you remember that beat down basement couch?\nI'd sing you my love songs and you'd tell me about\nHow your mama ran off and pawned her ring\nI remember, I remember everything\n\nA cold shoulder at closing time\nYou were begging me to stay 'til the sun rose\nStrange words come on out\nOf a grown man's mouth when his mind's broke\nPictures and passin' time\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Another Love, Artist: Tom Odell, Album: Long Way Down (Deluxe), Popularity: 92, Lyrics: I wanna take you somewhere so you know I care\nBut it's so cold, and I don't know where\nI brought you daffodils in a pretty string\nBut they won't flower like they did last spring\n\nAnd I wanna kiss you, make you feel alright\nI'm just so tired to share my nights\nI wanna cry and I wanna love\nBut all my tears have been used up\n\nOn another love, another love\nAll my tears have been used up\nOn another love, another love\nAll my tears have been used up\nOn another love, another love\nAll my tears have been used up\n\n...\n\n******* This Lyrics is NOT for Commercial use *******"}
{"text": "Track Name: Primera Cita, Artist: Carin Leon, Album: Colmillo De Leche, Popularity: 87, Lyrics: Te vi, me viste, al principio fue una broma\nLuego la verdad se asoma, intercambiamos sonrisas\nPasó algún tiempo, poco menos de una hora\nY por debajo de la mesa\nTu tacón tocó mi bota\n\nFue más sencillo que hacer la tabla del uno\nY a la hora del desayuno ya sabía que te amaba\nA las semanas de iniciar con la aventura\nSe nos hizo miel la luna y un concierto pa Tijuana\n\nEra prohibido, era imposible\n...\n\n******* This Lyrics is NOT for Commercial use *******"}